Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: the copper wire is covered in a material such as plastic which is an insulator to protect people handling the wire and also prevent the wire from making an electrical connection with other metal objects .
af: die koperdraad word omhul deur 'n materiaal soos plastiek wat 'n nie geleier is om mense wat die draad hanteer te beskerm en om te keer dat die draad 'n elektriese verbinding met andermetaalvoorwerpe maak .

source: why are insulators important ?
af: hoekom is nie geleiers belangrik? .

source: insulators protect people from electric shock; in some cases from possible death .
af: isolators beskerm mense teen elektriese skok en in sekere gevalle teen moontlike dood .

source: insulators also protect appliances from damage .
af: die beskerm ook elektriese toestelle teen skade .

source: list five insulating materials .
af: maak 'n lys van vyf nie geleidende materiale .

source: glass plastic wood ceramics rubber chalk paper cardboard etc
af: glas plastiek hout keramiek rubber kalk papier karton ens .

source: the pole is made of wood which does not conduct electricity and there are ceramic caps between the power lines and the pole which act as further insulators .
af: die paal is van hout gemaak en hout gelei nie elektrisiteit nie .

source: he is wearing gloves made of material and rubber as they are electrical insulators and therefore protect him from getting an electric shock when handling electrical wires and appliances .
af: hy dra handskoene wat van materiaal en rubber gemaak is omdat hulle elektriese isolators is .

source: the thick soles on his shoes also prevent an electric current from passing through him and into the earth .
af: dit beskerm hom dus teen&#8216;n elektriese skok terwyl hy elektriese drade en toestelle hanteer .

source: this unit is mostly application of what has been learnt before .
af: hierdie eenheid is meestal toepassing van wat vantevore geleer is .

source: develop some of the science process skills observe design evaluate and communicate .
af: ontwikkel sommige van die wetenskaplike prosesvaardighede waarneming ontwerp evaluase en kommunikasie .

source: in order to develop thinking and motor skills give the learners a project to build a model of a house that includes electrical wiring .
af: gee die leerders 'n projek om 'n model van 'n huis wat elektriese bedrading insluit te bou .

source: electric circuits are used all around us for example in lights in our homes streets and shops .
af: elektriese stroombane word orals om ons gebruik byvoorbeeld in die ligte in ons huis strate en winkels .

source: let us imagine our world of today without electricity !
af: kan ons ons w&#234;reld van vandag indink sonder elektrisiteit ?

source: let the learners work in groups of 2 4 .
af: laat die leerders in groepe van 2 4 werk .

source: there are no specific right or wrong answers here except if the responses do not have anything to do with electricity .
af: daar is geen spesifieke regte of verkeerde antwoorde hier nie behalwe as die antwoordeniks met elektrisiteit te doen het nie .

source: the learners are giving their perceptions and opinions .
af: die leerders gee hulle menings en indrukke .

source: the activity provides a starting point for learning about the use of electric circuits .
af: die aktiwiteit verskaf 'n beginpunt om te leer oor die gebruik van stroombane .

source: write a short paragraph of how our world would be like without electricity .
af: skryf 'n kort paragraaf oor hoe ons w&#234;reld sou gewees het sonder elektrisiteit .

source: describe the three things that will be the biggest disaster for you if there was no electricity .
af: beskryf die drie dinge wat vir jou die ergste sal wees as daar geen elektrisiteit was nie .

source: would there be any advantages of not having electricity ?
af: sal daar enige voordele daaraan wees om nie elektrisiteit te h&#234; nie ?

source: discuss this with your classmates and write your answer below .
af: bespreek dit met jou klasmaats en skryf jou antwoord hieronder neer .

source: your group should now compare the advantages and disadvantages of electricity .
af: jou groep moet nou die voor en nadele van elektrisiteit vergelyk .

source: what is the group's conclusion a yes or no for electricity ?
af: wat is die groep se slotsom 'n ja of 'n nee vir elektrisiteit ?

source: write down your group's reasons for saying yes or no .
af: skryf jou groep se redes vir die ja of nee antwoord neer .

source: electric circuits are often used to solve a problem where we need energy .
af: stroombane word gereeld gebruik om 'n probleem op te los waar ons energie nodig het .

source: a battery or mains supply is a source of energy .
af: 'n battery of 'n muurprop is bronne van energie .

source: the energy is transported to a device or an appliance using electric wires .
af: die energie word na 'n toestel gelei deur elektriese drade .

source: the device or appliance dissipates the energy .
af: die toestel skakel die energie om in 'n ander vorm van energie .

source: the effect could be light sound heat or movement .
af: die effek kan lig klank hitte of beweging wees .

source: in other words the device gives off energy in the form of light sound heat or movement .
af: met ander woorde die toestel gee energie af in die vorm van lig klank hitte of beweging .

source: a system is something that consists of different parts working together to form a whole .
af: 'n stelsel is iets wat uit verskillende dele bestaan wat saamwerk om 'n geheel te vorm .

source: in an electric system there is an input energy and an output resulting in light heat movement or sound .
af: in 'n elektriese stelsel is daar 'n invoer elektriese energie en 'n uitvoer iets soos lig hitte bewegings of klankenergie. kom ons kyk na 'n paar voorbeelde van elektriese stelsels waar ons die uitvoerenergie gebruik om iets nuttigs tedoen .

source: energy is transferred or dissipated not transformed .
af: energie word oorgedra of omgeskakel nie verander nie .

source: energy is defined as the capacity to do work so it does not change from one form to another but it can be transferred .
af: energie word gedefinieer as die kapasiteit om werk te doen so dit verander nie van een vorm na 'n ander nie maar dit skakel om van een werk na 'n ander .

source: use
af: gebruik

source: energy transferred from energy to
af: energie verander van energie na energie

source: this is quite a long activity with many examples but it leads into the technology project a bit later where learners have to use an electric circuit to produce light movement sound or heat .
af: hierdie is 'n redelike lang aktiwiteit met 'n klomp voorbeelde maar dit bied 'n inleiding tot die tegnologieprojek 'n bietjie later .

source: this activity will act as a stimulus for ideas for the project .
af: hier sal leerders gebruik moet maak van 'n stroombaan om lig beweging klank of hitte te produseer .

source: each of the examples in the previous activity uses an electric circuit to provide us with energy where we need it whether it is light on the street sound for our radio or heat in a building .
af: elkeen van die voorbeelde in die vorige aktiwiteit gebruik 'n stroombaan om energie te voorsien waar ons dit benodig of dit nou is om die straat te verlig klank aan ons radio te verskaf of om 'n gebou te verhit .

source: or even in some toys and models such as a car racing game or model electric train set !
af: selfs in sekere speelgoed en modelle soos byvoorbeeld 'n motorrenspeletjie of 'n elektriese modeltreinstel !

source: we can say that electrical appliances can solve problems for us .
af: ons kan s&#234; dat elektriese toestelle vir ons probleme kan oplos .

source: they are able to transfer electricity so that another useful form of energy is released .
af: hulle is in staat om elektriese energie in ander nuttige vorms van energie te verander .

source: at this point learners have learnt adequate concepts related to electricity to give them a technology design project to do .
af: teen hierdie tyd het leerders genoeg konsepte in verband met elektrisiteit geleer om vir hulle 'n tegnologie ontwerpprojek te gee om tedoen .

source: they can work individually or in teams of 3 4 .
af: hulle kan individueel of in groepe van 3 4 werk .

source: ideally though each learner should design and make their own system to fully engage with the task .
af: ideaal gesproke moet elke leerder sy eie stelsel ontwerp en bou om homself ten volle by die taak te betrek .

source: learners will apply what they learnt by first discussing designing and drawing a plan of how to use a circuit to produce movement light sound or heat .
af: leerders sal toepas wat hulle geleer het deur eers 'n plan te bespreek te ontwerp en te teken hoe hulle 'n stroombaan kan gebruik om beweging lig klank of hitte te produseer .

source: it is generally more difficult to produce heat energy using cells but this can be explored by learners if they feel they are up to it .
af: oor die algemeen is dit moeiliker om hitte energie te produseer met die gebruik van selle maar leerders kan dit ondersoek as hulle voel hulle is reg daarvoor .

source: then they will implement their design and make the structure and then present it to the class .
af: hierna sal hulle hulle ontwerp implementeer en 'n struktuur bou en aan die klas voorl&#234; .

source: communication is a vital skill and forms part of the technology design process .
af: kommunikasie is 'n baie belangrike vaardigheid en vorm deel van die tegnologie ontwerpproses .

source: communication can be written or verbal but in this case learners must verbally present their designs to the class .
af: kommunikasiekan of skriftelik of mondelings wees maar in hierdie geval moet die leerders hulle ontwerp mondelings aan die klas voorl&#234; .

source: the model that learners build need not be to scale .
af: die modellewat die leerders bou hoef nie op skaal te wees nie .

source: possible designs include a steady hand game a house encourage them to have more thanone room or a doorbell system a lighthouse or some type of toy which produces sound or movement .
af: moontlike ontwerpe is 'n bestendige handspeletjie 'n huis moedig hulle aan om meer as een kamer te h&#234; of 'n deurklokkiestelsel 'n vuurtoring of een of ander tipe speelding wat klank of bewegingproduseer .

source: encourage learners to use everything that they have learnt about electric circuits and include different components such as switches .
af: moedig leerders aan om alles wat hulle oor stroombane geleer het te gebruik en om verskillende komponente in hulle projek in te sluit soos byvoorbeeld skakelaars .

source: let's say you want to become an electrical engineer or electrician .
af: gestel jy wil 'n elektriese ingenieur of 'n tegnikus word .

source: one of the things that you will be doing is to design systems that use circuits to solve problems for people whether it is the wiring in a house an alarm bell a lighthouse on the coast or constructing toys which use electrical energy to work .
af: een van die dinge wat jy saldoen is om stelsels te ontwerp wat stroombane gebruik om probleme vir mense op te los of dit die bedrading in 'n huis is 'n voordeurklokkie 'n vuurtoring op die kus of om speelgoed te bou wat elektrisiteit nodig het om te werk .

source: you are an electrical engineer and you need to come up with a design for an electrical system to solve a problem .
af: jy is 'n elektriese ingenieur en jy moet 'n ontwerp uitdink vir 'n elektriese stelsel wat 'n probleem oplos .

source: you need to design and make a system that uses a circuit to produce movement light sound or heat .
af: jy moet 'n stelsel ontwerp en bou wat 'n stroombaan gebruik om beweging lig klank of hitte te produseer .

source: write a design brief where you identify what you are going to make and why it needs an electric circuit .
af: skryf 'n beskrywing van jou ontwerp waar jy s&#234; wat jy gaan bou en hoekom dit 'n stroombaan benodig .

source: the next step in the design process is to do some research about the instrument that you are going to make .
af: die volgende stap in die ontwerpproses is om navorsing te doen oor die instrument wat jy gaan bou maak .

source: you can use books and the internet to do your research .
af: jy kan boeke en die internet gebruik vir jou navorsing .

source: answer these questions when doing research about your electrical system
af: beantwoord hierdie vrae tydens jou navorsing oor die elektriese stelsel

source: how is this system normally made ?
af: hoe word hierdie stelsel normaalweg gebou ?

source: what components does it need ?
af: watter komponente word benodig ?

source: what type of energy will be produced from electrical energy ?
af: watter tipe energie gaan gemaak word uit die elektriese energie ?

source: why do people need this system ?
af: hoekom benodig mense so 'n stelsel ?

source: what problem does it solve ?
af: wat is die probleem wat daardeur opgelos word ?

source: now that you know a bit more about the system you want to make you need to design how you are going to make it .
af: noudat jy 'n bietjie meer weet oor die sisteem wat jy wil bou is dit nodig om die bou ontwerp te doen .

source: your system has the following specifications
af: jou stelsel het die volgende spesifikasies vereistes

source: your system has the following constraints
af: jou stelsel het die volgende beperkinge

source: answer these questions
af: beantwoord hierdie vrae

source: now you need to draw some designs for your system .
af: nou moet jy 'n paar ontwerpe vir jou stelsel teken .

source: once you are happy with your design use the space below to draw your design .
af: wanneer jy gelukkig is met jou ontwerp gebruik die spasie hieronder om jou ontwerp te teken .

source: when you are making your system you might get better ideas to improve the design as you test it out to see if it produces the required output .
af: terwyl jy jou sisteem bou mag jy dalk met nog idees vorendag kom om die ontwerp te verbeter soos jy dit toets om te sien of dit die gewensde resultate lewer .

source: so come back afterwards and draw on the bottom half of the page; show what you really decided to make .
af: maak seker dat jy na die tyd terugkom en om op die onderste helfte van die bladsy te teken wat jy in werklikheid gemaak het .

source: now make your system !
af: bou nou jou stelsel !

source: after you have all finished making your systems perhaps go around and look at what others have done .
af: nadat jy jou stelsel klaar gemaak het loop rond en kyk wat die ander gedoen het .

source: ask each other questions to see what you can learn from others .
af: vra gerus vrae om te sienwat julle van mekaar kan leer .

source: you will also have to present your project to the class so use this time to get ideas about how to present your idea and product that you made .
af: jy sal ook 'n voorlegging aan jou klas moet doen so gebruik hierdie tyd om idees te kry oor hoe jy jou idee en produk gaan voorstel .

source: before we get on to presenting the projects you need to evaluate your own project .
af: voordat ons by die voorlegging van die projekte kom moet jy eers jou eie projek evalueer .

source: you can then use this evaluation in your presentation to show others what worked and did not work .
af: dan kan jy hierdie evaluering in jouvoorlegging gebruik om aan die ander te wys wat gewerk het en wat nie .

source: does your system look like your initial design ?
af: lyk jou stelsel soos jou oorspronklike ontwerp ?

source: does your system produce a movement sound light or heat ?
af: vervaardig jou stelsel beweging klank lig of hitte ?

source: where would people use the system you designed to solve a problem in our daily lives ?
af: waar sal mense die stelsel wat jy ontwerp het gebruik om 'n probleem in hulle daaglikse lewens op te los ?

source: is there anything you might do differently to improve your design ?
af: is daar enigiets wat jy anders sou doen om jou ontwerp te verbeter ?

source: an engineer needs to be able to present their designs to show others what they have come up and communicate their ideas .
af: ingenieurs moet hulle ontwerpe aan ander kan voorl&#234; om te kan wys waarmee hulle vorendag gekom het en om idees te kommunikeer .

source: engineers can present a written report and hand in their design drawings .
af: ingenieurs kan 'n geskrewe verslag voorl&#234; enontwerptekeninge ingee .

source: but often an engineer will need to present the design and project by speaking and giving a verbal report .
af: maar dikwels moet ingenieurs ook 'n voorlegging van die ontwerp en projek doen deur toesprake en mondelingse verslae .

source: your last task in this design project is to present your system to your class .
af: jou opdrag in hierdie ontwerpprojek is om jou stelsel aan die klas voor te l&#234; .

source: these are your instructions
af: hier volg jou instruksies

source: each learner must be assessed for the actual system that they built and their designs drawings and planning .
af: elke leerder moet geassesseer word na aanleiding van die werklike stelsel wat hulle gebou het en ook hulle ontwerpe tekeninge en beplanning .

source: and each learner must be assessed in the way that they present their project orally .
af: elke leerder moet geassesseer word oor die aard van hulle mondelingse projekvoorlegging .

source: pay special attention to the learner's ability to project their voice and engage with the class their ability to explain what they have done and whether they answered all the questions outlined in the instructions above .
af: gee spesifiek aandag aan die leerders se vermo&#235; om hulle stemme te projekteer en om die klas te betrek hulle vermo&#235; om te verduidelik wat hulle gedoen het en of hulle die vrae beantwoord het wat in die instruksies uiteengesit is .

source: name five things that we would not be able to do without using electricity .
af: noem vyf dinge wat ons nie sonder elektrisiteit sal kan doen nie .

source: explain why you think each of these things is important to us .
af: verduidelik waarom jy dink hierdie dinge vir ons belangrikis .

source: check that they have justified why each is important .
af: maak seker hulle motiveer hul antwoorde .

source: jason builds an electric circuit that includes a bulb and battery for his bedside table so that he can read at night but the bulb does not light up .
af: jason bou 'n elektriese stroombaan wat 'n gloeilamp en 'n battery in het vir sy bedliggie sodat hy in die aand kan lees .

source: list three things that could be wrong .
af: die gloeilamp wil egter nie brand nie .

source: the battery could be placed the wrong way the battery is flat there is a break in the connection somewhere one of the wires is not connected properly or is broken the bulb may have blown' meaning the filament inside the bulb is broken .
af: hy kon die batttery verkeerd ingesit het die battery is dalk pap daar is &#234;rens 'n onderbreking in die verbinding een van diedrade is nie ordentlik gekoppel nie of is stukkend die gloeilamp het dalk geblaas&#8221; wat beteken dat die gloeidraadjie in die lampie stukkend is .

source: jason does not want the battery in his bedside light to run out of energy .
af: jason wil nie h&#234; dat die battery in sy bedliggie se energie opraak nie .

source: what could he do ?
af: wat kan hy doen ?

source: he can include a switch to turn it on and off to save the battery .
af: hy kan 'n skakelaar insit om die liggie aan en af te skakel en die battery te spaar .

source: list three electrical devices that use energy from a battery .
af: skryf drie elektriese toestelle neer wat energie van 'n battery gebruik .

source: torch cellphone walkman etc .
af: flits selfoon draagbare radio ens

source: list three electrical devices that use energy from a mains supply .
af: skryf drie elektroniese toestelle neer wat energie van die hooftoevoerkabel gebruik .

source: microwave stove iron hairdryer fridge etc .
af: mikrogolf stoof yster haardro&#235;r yskas ens .

source: draw an electric circuit diagram for the system that you designed and made in the design project .
af: teken 'n elektriese stroombaandiagram vir die sisteem wat jy ontwerp en gemaak het in die ontwerpprojek .

source: this unit lends itself to searching for information pictures simulations and videos on the internet in the library in magazines and books .
af: die eenheid leen homself tot die soek van inligting prente simulasies en videos op die internet die biblioteek tydskrifte enboeke .

source: the basic information about the main topic is provided here but teachers and learners should explore the topic further .
af: die basiese inligting oor die kernonderwerp word hier voorsien maar onderwysers en leerders moet die onderwerpverder ondersoek .

source: we are so used to switching on electrical appliances that we hardly think what makes it possible to have these things .
af: ons is so gewoond aan elektriese toestelle aan en af skakel dat ons nie eers meer dink aan hoe dit moontlik is om nie die toestelle teh&#234; nie .

source: our focus turns to appliances that need a mains electrical supply .
af: ons fokus skuif nou na elektriese toestelle wat 'n hooftoevoerkabel nodig het .

source: you have listed examples like a television a computer a kettle and many others before .
af: jy het voorbeelde soos die televisie 'n rekenaar 'n ketel en baie ander alreeds genoem .

source: the big question here is where does mains electricity come from?'
af: die groot vraag is waar kom die elektrisiteit in die hooftoevoerkabel vandaan ?

source: however our homes schools shops and factories cannot run on batteries because they cannot store or provide large amounts of energy .
af: ons huise skole winkels en fabrieke kan egter niebatterye gebruik nie want hulle kan nie genoeg energie opgaar om die groot hoeveelhede wat die plekke nodig het te voorsien nie .

source: the main supplier of electrical energy is from power stations .
af: die hoofversk

source: coal oil and natural gas are fossil fuels .
af: steenkool olie en aardgasse is fossielbrandstowwe .

source: some people think that fossil fuels are the remains of dead dinosaurs but this is not true !
af: sommige mense dink dat fossielbrandstowwe die oorblyfsels van dooiedinosaurusse is .

source: actually most of the fossil fuels we find today were formed millions of years before even the first dinosaurs .
af: eintlik het meeste van die fossielbrandstof wat ons vandag kry miljoene jare voor die dinosourusse gevorm .

source: fossil fuels were once alive !
af: fossielbrandstowwe was eens lewendig !

source: do you remember learning about fossils in gr. 5 earth and beyond ?
af: onthou jy dat jy in graad 5 in &#8220;die aarde en die heelal&#8221; geleer het oor fossiele .

source: write down what you think a fossil is .
af: skryf neer wat jy dink 'n fossiel is .

source: a fossil is the remains of a dead organism plant or animal from millions of years ago .
af: 'n fossiel is die oorblyfsels van 'n dooie organisme plant of dier van miljoene jare gelede .

source: so fossil fuels are actually the remains of prehistoric organisms that lived millions of years ago !
af: fossielbrandstof is dus eintlik die oorblyfsels van prehistoriese organismes wat miljoene jare gelede gelewe het !

source: different fossil fuels come from different organisms and formed in slightly different ways .
af: verskillende fossielbrandstowwe kom van verskillende organismes en vorm op verskillende maniere .

source: how fossil fuels are made
af: hoe word fossielbrandstof gemaak ?

source: this activity is meant as a comprehension for reading appreciation .
af: hierdie aktiwiteit moet as 'n leesbegrip vir waardering gedoen word .
